Dataframe : 여러 series data (하나의 series data는 numpy data) 의 합, 칼럼마다 데이터 타입 정해져 있음 (칼럼별로 데이터 타입 다를 수 있음, 데이터프레임의 파워풀한 점!)<br>
series를 여러개 붙힌 기본 Data Table은 기본 2차원이다.

In [1]:
import pandas as pd
import numpy as np

In [3]:
raw_data = {
    'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
    'age': [42, 52, 36, 24, 73],
    'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']
}

# raw data 의 key 값은 column 명으로, value 값은 실제 데이터로 들어감 
# DataFrame 생성
df = pd.DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city'])
df = pd.DataFrame(raw_data) # 굳이 컬럼 지정해주지 않아도 ! 

# DataFrame 출력
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [4]:
# 특정 column 선택
df = pd.DataFrame(raw_data, columns=['age', 'city'])
print(df)

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [5]:
# 새로운 column 추가
df = pd.DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])
print(df)

# 이떼 value 값은 전부 Nan 이 뜸

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [6]:
# column 선택 - series 추출
print(df.first_name)

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [7]:
# column 선택 - series 추출 (다른 방법)
print(df['first_name'])

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [12]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [10]:
# loc - index location을 사용한 선택
print(df.loc[1])

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [11]:
# iloc - index position을 사용한 선택
print(df['age'].iloc[:3])

0    42
1    52
2    36
Name: age, dtype: int64

In [8]:
# row instance 뽑는법 ! 

# np.nan 값을 가지는 Series 생성, 인덱스는 [49, 48, 47, 46, 45, 1, 2, 3, 4, 5]로 설정
s = pd.Series(np.nan, index=[49, 48, 47, 46, 45, 1, 2, 3, 4, 5])

# loc을 사용하여 인덱스 이름(49, 48, 47)에 해당하는 데이터 선택
print(s.loc[:3])  # 출력: 49, 48, 47 인덱스에 해당하는 NaN 값 
# ==> index number !!!!!!

# iloc을 사용하여 인덱스 번호(0, 1, 2)에 해당하는 데이터 선택
print(s.iloc[:3])  # 출력: 첫 세 개의 인덱스 (49, 48, 47)에 해당하는 NaN 값
# => index number !!!!!!!

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64
49   NaN
48   NaN
47   NaN
dtype: float64

In [14]:
df.debt = df.age > 40
# 이렇게 아까 생성해둔 컬럼에 답 넣어주기 ! 
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [15]:
# transpoes 
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [16]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [17]:
df.to_csv()

',first_name,last_name,age,city,debt\r\n0,Jason,Miller,42,San Francisco,True\r\n1,Molly,Jacobson,52,Baltimore,True\r\n2,Tina,Ali,36,Miami,False\r\n3,Jake,Milner,24,Douglas,False\r\n4,Amy,Cooze,73,Boston,True\r\n'

In [26]:
del df["age"]

In [29]:
del df.last_name # 삭제할때는 . index 못쓴당

AttributeError: 'DataFrame' object has no attribute 'last_name'

In [27]:
# 중첩된 딕셔너리(nested dict)를 사용하여 데이터 생성
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

# DataFrame 생성
df = pd.DataFrame(pop)

# 생성된 DataFrame 출력
print(df)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5